#### Terraform Workspace - `sandbox`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
workspaces/sandbox relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructura/infrastructura/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructura/infrastructura

To view this run in a browser, visit:
https://app.terraform.io/app/aetherisnova/sandbox/runs/run-2v14oiKsWfXbDYQL

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.digitalocean_domain.domain: Refreshing...
module.portae_astrales_app.data.doppler_secrets.portae_astrales: Refreshing...
data.digitalocean_domain.domain: Refresh complete after 0s [id=aetherisnova.org]
module.portae_astrales_app.data.doppler_secrets.portae_astrales: Refresh complete after 0s [id=d21a14834e972a1758bbce1f45e1752ba5fe5bf9a83aade6c0bdd71f1acbffa2]
module.portae_astrales_app.digitalocean_app.app: Refreshing state... [id=178fd1d2-6ed2-47b6-a0bb-c553e2730e91]
digitalocean_project.project: Refreshing state... [id=5bfb4ddb-e5ff-4502-9b82-8a5c2724cac2]
module.portae_astrales_app.digitalocean_app.app: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_record.portae_astrales_app_domain will be created
  + resource "digitalocean_record" "portae_astrales_app_domain" {
      + domain = "aetherisnova.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "portaeastrales.sandbox"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "https://sandbox--portae-astrales-app-pxd93.ondigitalocean.app"
    }

  # module.portae_astrales_app.digitalocean_app.app will be updated in-place
  ~ resource "digitalocean_app" "app" {
        id                   = "178fd1d2-6ed2-47b6-a0bb-c553e2730e91"
        # (8 unchanged attributes hidden)

      ~ spec {
            name     = "sandbox--portae-astrales-app"
            # (3 unchanged attributes hidden)

          ~ domain {
                name     = "portaeastrales.sandbox.aetherisnova.org"
              - zone     = "aetherisnova.org" -> null
                # (2 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kieranroneill, Action: `pull_request`, Working Directory: ``, Workflow: `Sandbox`*